; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v1)
		(pred_6 ?v8)
		(pred_2 ?v2)
		(pred_3 ?v2)
		(pred_5 ?v8 ?v2)
		(pred_4)
		(pred_1 ?v8))

   (:action op_1
       :parameters  (?v3 ?v6)
       :precondition (and (not-eq ?v3 ?v6) 
                          (pred_2 ?v3) (pred_2 ?v6) (pred_3 ?v3))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v3))))


   (:action op_3
       :parameters (?v4 ?v5)
       :precondition  (and  (pred_6 ?v4) (pred_2 ?v5)
			    (pred_5 ?v4 ?v5) (pred_3 ?v5) (pred_4))
       :effect (and (pred_1 ?v4)
		    (not (pred_5 ?v4 ?v5)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v4  ?v5)
       :precondition  (and  (pred_6 ?v4) (pred_2 ?v5)
			    (pred_1 ?v4) (pred_3 ?v5))
       :effect (and (pred_5 ?v4 ?v5)
		    (pred_4)
		    (not (pred_1 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_02 obj_05 obj_01 
          obj_06 obj_03 obj_04 
)
(:init
(pred_2 obj_02)
(pred_2 obj_05)
(pred_2 obj_01)
(pred_6 obj_06)
(pred_6 obj_03)
(pred_6 obj_04)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(pred_4)
(pred_5 obj_06 obj_02)
(pred_5 obj_03 obj_05)
(pred_5 obj_04 obj_02)
(pred_3 obj_05)
)
(:goal
(and
(pred_5 obj_06 obj_01)
(pred_5 obj_03 obj_01)
(pred_5 obj_04 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_06 obj_01) (pred_3 obj_05))
    (sometime-before  (pred_5 obj_03 obj_01) (pred_3 obj_02))
    (sometime-before  (pred_5 obj_04 obj_01) (pred_3 obj_05))
  )
)
)

; plan
1. (op_3 obj_03 obj_05)
   deleted: (pred_5 obj_03 obj_05) (pred_4)
   added: (pred_1 obj_03)
   goals met: 0 of 3
2. (op_1 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_01)
   goals met: 0 of 3
3. (op_1 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_02)
   goals met: 0 of 3
4. (op_2 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_5 obj_03 obj_02) (pred_4)
   goals met: 0 of 3
5. (op_3 obj_04 obj_02)
   deleted: (pred_5 obj_04 obj_02) (pred_4)
   added: (pred_1 obj_04)
   goals met: 0 of 3
6. (op_1 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 0 of 3
7. (op_2 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_5 obj_04 obj_01) (pred_4)
   goals met: 1 of 3
8. (op_1 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_02)
   goals met: 1 of 3
9. (op_3 obj_03 obj_02)
   deleted: (pred_5 obj_03 obj_02) (pred_4)
   added: (pred_1 obj_03)
   goals met: 1 of 3
10. (op_1 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 1 of 3
11. (op_2 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_5 obj_03 obj_01) (pred_4)
   goals met: 2 of 3
12. (op_1 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_02)
   goals met: 2 of 3
13. (op_3 obj_06 obj_02)
   deleted: (pred_5 obj_06 obj_02) (pred_4)
   added: (pred_1 obj_06)
   goals met: 2 of 3
14. (op_1 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 2 of 3
15. (op_2 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_5 obj_06 obj_01) (pred_4)
   goals met: 3 of 3
